Revit 2024 API
RebarShapeDefinitionByArc.Type Property
 Among those rebar shapes defined by an arc, specify which kind.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2009
Syntax
C#
public RebarShapeDefinitionByArcType Type { get; set; }
Visual Basic
Public Property Type As RebarShapeDefinitionByArcType
	Get
	Set
Visual C++
public:
property RebarShapeDefinitionByArcType Type {
	RebarShapeDefinitionByArcType get ();
	void set (RebarShapeDefinitionByArcType value);
}
Remarks
 This property may be explicitly set to Arc or LappedCircle. But to set the property to Spiral, you must call SetArcTypeSpiral() and provide default values for the height, pitch, and finishing turns.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The arc type cannot be set directly to Spiral. Instead, call SetArcTypeSpiral() to provide defaults for spiral parameters.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
RebarShapeDefinitionByArc Class
Autodesk.Revit.DB.Structure Namespace